Documents/ИзменениеКвотыПоТрудоустройству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеКвотыПоТрудоустройству</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТрудоустройствоСотрудниковПоКвотам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКвоты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКвотДляТрудоустройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудоустроенПоКвоте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияКвоты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииСотрудниковТрудоустроенныхПоКвотам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИзменениеКвотыПоТрудоустройству/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	МодульТрудоустройствоПоКвотам = ОбщегоНазначения.ОбщийМодуль("ТрудоустройствоПоКвотам");
	МодульТрудоустройствоПоКвотам.СформироватьДвиженияПоТрудоустройствуСотрудниковПоКвотам(Движения, ДанныеДляПроведения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеКвотыПоТрудоустройству.Дата КАК Период,
	|	ИзменениеКвотыПоТрудоустройству.Организация КАК Организация,
	|	ИзменениеКвотыПоТрудоустройствуСотрудники.Сотрудник КАК Сотрудник,
	|	ИзменениеКвотыПоТрудоустройствуСотрудники.ТрудоустроенПоКвоте КАК ТрудоустроенПоКвоте,
	|	ВЫБОР
	|		КОГДА ИзменениеКвотыПоТрудоустройствуСотрудники.ТрудоустроенПоКвоте
	|			ТОГДА ИзменениеКвотыПоТрудоустройству.ВидКвоты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКвотДляТрудоустройства.ПустаяСсылка)
	|	КОНЕЦ КАК ВидКвоты,
	|	ВЫБОР
	|		КОГДА ИзменениеКвотыПоТрудоустройствуСотрудники.ТрудоустроенПоКвоте
	|			ТОГДА ИзменениеКвотыПоТрудоустройствуСотрудники.КатегорияКвоты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КатегорииСотрудниковТрудоустроенныхПоКвотам.ПустаяСсылка)
	|	КОНЕЦ КАК КатегорияКвоты
	|ИЗ
	|	Документ.ИзменениеКвотыПоТрудоустройству.Сотрудники КАК ИзменениеКвотыПоТрудоустройствуСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеКвотыПоТрудоустройству КАК ИзменениеКвотыПоТрудоустройству
	|		ПО ИзменениеКвотыПоТрудоустройствуСотрудники.Ссылка = ИзменениеКвотыПоТрудоустройству.Ссылка
	|ГДЕ
	|	ИзменениеКвотыПоТрудоустройству.Ссылка = &Ссылка";
	
	ДанныеДляПроведения = Новый Структура; 
	ДанныеДляПроведения.Вставить("ТрудоустройствоСотрудниковПоКвотам", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
